In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('weather_data_ny.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [3]:
# Replace 

new_df = df.replace(-99999, np.NaN)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [4]:
# Replace 2 values  in all column

new_df = df.replace([-99999,2], np.NaN)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        NaN  Sunny
6  1/6/2017         34.0        5.0      0

In [5]:
# Replace 2 values  in specific column

new_df = df.replace({
    'temperature':-99999,
    'windspeed': -99999,
    'event':'0'
}, np.NaN)

new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [6]:
# mapping - which values to reaplce with what 

new_df = df.replace({
 -99999 : np.NaN
})

new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [7]:
df2 = pd.read_csv('weather_data_ny2.csv')
df2

        day temperature windspeed  event
0  1/1/2017        32 F         6   Rain
1  1/2/2017      -99999     7 mph  Sunny
2  1/3/2017          28    -99999   Snow
3  1/4/2017      -99999      7 km      0
4  1/5/2017        32 C    -99999   Rain
5  1/6/2017          31    2 mile  Sunny
6  1/6/2017          34         5      0

# Regex

In [8]:
# removing the data units 

new_df2 = df.replace({
    'temperature':'[A-Za-z]',
    'windspeed':'[A-Za-z]'
    },'',regex=True)
new_df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

# Replacing multiple data in the same line

In [9]:
df3 = pd.DataFrame({
    'source': ['good','okay','super','average','failed'],
    'student':['anik','sileshi','bhuwan','hitman','dragon']
})
df3

    source  student
0     good     anik
1     okay  sileshi
2    super   bhuwan
3  average   hitman
4   failed   dragon

In [10]:
df3=df3["source"].replace(['failed','okay','average','good','super'], [0,1,2,3,4])
df3

0    3
1    1
2    4
3    2
4    0
Name: source, dtype: int64